[
  {
    "name": "Basic Cardio Routine",
    "category": "beginner",
    "description": "A simple routine suitable for beginners to increase heart rate and burn calories.",
    "exercises": [
      {
        "name": "Jumping Jacks",
        "description": "Stand with your feet together and your hands at your sides. Simultaneously raise your arms above your head and jump up just enough to spread your feet out wide.",
        "sets": 3,
        "repetitions": 20
      },
      {
        "name": "High Knees",
        "description": "Stand in place with your feet hip-width apart. Drive your knee toward your chest and quickly place it back on the ground. Follow immediately by driving the knee of the other leg toward your chest.",
        "sets": 3,
        "repetitions": 15,
        "repeat_on": "each side"
      },
      {
        "name": "Fast Feet",
        "description": "Start with your feet hip-width apart. Squat down slightly and move your feet as fast as you can.",
        "sets": 3,
        "duration_in_seconds": 30
      }
    ]
  },
  {
    "name": "Intermediate Cardio Routine",
    "category": "intermediate",
    "description": "A slightly more challenging routine designed to push your cardiovascular fitness.",
    "exercises": [
      {
        "name": "Burpees",
        "description": "From a standing position, squat, place you hands on the ground, and 'jump' your feet out into a push up position. Perform a push up, then 'jump' your feet back to your hands. Then jump as high as you can, throwing your hands over your head.",
        "sets": 3,
        "repetitions": 10
      },
      {
        "name": "Mountain Climbers",
        "description": "Start on your hands and knees. Bring your left foot forward directly under your chest while straightening your right leg. Keeping your hands on the ground and core tight, jump and switch legs.",
        "sets": 3,
        "repetitions": 15,
        "repeat_on": "each side"
      },
      {
        "name": "Jump Squats",
        "description": "Stand with your feet shoulder-width apart. Start by doing a regular squat, then engage your core and jump up explosively. When you land, lower your body back into the squat position to complete one rep.",
        "sets": 3,
        "repetitions": 15
      }
    ]
  },
  {
    "name": "Advanced Cardio Routine",
    "category": "advanced",
    "description": "A high intensity routine for advanced individuals. Not recommended for beginners.",
    "exercises": [
      {
        "name": "Plyo Pushups",
        "description": "Start in a traditional pushup position, but push yourself up so forcefully that your hands leave the ground. Catch yourself, lower to the bottom position, and repeat.",
        "sets": 3,
        "repetitions": 10
      },
      {
        "name": "Box Jumps",
        "description": "Stand in front of a sturdy box or bench. Squat down and then explode upwards to jump onto the box. Step back down and repeat.",
        "sets": 3,
        "repetitions": 15
      },
      {
        "name": "Double Unders",
        "description": "With a jump rope, turn the rope faster and jump slightly higher to achieve two rope rotations per jump.",
        "sets": 3,
        "repetitions": 20
      }
    ]
  }
]
