[
  {
    "name": "Beginner Chest & Arms Routine",
    "description": "A basic routine suitable for beginners to start strengthening the chest and arms muscles.",
    "exercises": [
      {
        "name": "Push-ups",
        "description": "Keep your feet together and your hands shoulder-width apart, lower your body until your chest nearly touches the floor. Push yourself back to the starting position.",
        "sets": 3,
        "repetitions": 10
      },
      {
        "name": "Bicep Curls with Resistance Bands",
        "description": "Stand on a resistance band. Hold one end in each hand, arms fully extended, palms facing forward. Curl your hands towards your shoulders, maintaining the position of your elbows. Slowly lower your hands back to the starting position.",
        "sets": 3,
        "repetitions": 10
      },
      {
        "name": "Chair Dips",
        "description": "Position your hands shoulder-width apart on a secured bench or stable chair. Move your bottom off the front of the bench with your legs extended out in front of you. Lower your body until your shoulders are below your elbows. Push back up until your elbows are nearly straight but not locked.",
        "sets": 3,
        "repetitions": 10
      }
    ]
  },
  {
    "name": "Intermediate Chest & Arms Routine",
    "description": "A slightly more challenging routine suitable for users with moderate fitness levels.",
    "exercises": [
      {
        "name": "Incline Push-ups",
        "description": "Find a stable surface above the ground like a bench. Place hands on the edge of the bench, walk your feet out and perform a push-up in this inclined position.",
        "sets": 3,
        "repetitions": 12
      },
      {
        "name": "Diamond Push-ups",
        "description": "Come into the top of a push-up position and place your hands close together so your thumbs and index fingers touch. Keeping your body straight and rigid, bend your elbows to lower your chest toward the floor, then press back up.",
        "sets": 3,
        "repetitions": 12
      },
      {
        "name": "Tricep Dips",
        "description": "Position your hands shoulder-width apart on a secured bench or stable chair. Slide your butt off the front of the bench with your legs extended out in front of you. Lower your body until your shoulders are below your elbows. Push back up until your elbows are nearly straight but not locked.",
        "sets": 3,
        "repetitions": 12
      }
    ]
  },

  {
    "name": "Advanced Chest & Arms Routine",
    "description": "A high-intensity routine for advanced users to really challenge their chest and arm muscles.",
    "exercises": [
      {
        "name": "One Arm Push-ups",
        "description": "Perform a push-up with only one hand on the ground, the other on your back.",
        "sets": 3,
        "repetitions": 10,
        "repeat_on": "each side"
      },
      {
        "name": "Archer Push-ups",
        "description": "Perform a push-up with one arm extended out to the side. As you lower yourself, keep one arm straight (like an archer pulling back their bow) while the other arm bends as in a regular push-up.",
        "sets": 3,
        "repetitions": 10,
        "repeat_on": "each side"
      },
      {
        "name": "Pike Push-ups",
        "description": "Start in a downward dog position with your hands and feet on the floor and your hips raised. Lower your upper body towards the floor while keeping your legs straight, then push yourself back up.",
        "sets": 3,
        "repetitions": 12
      }
    ]
  }
]
